{
  "users": [
    {
      "username": "climberjoe",
      "password": "test",
      "id": 1,
      "saved": [
        3,
        2,
        0
      ]
    },
    {
      "username": "admin",
      "password": "test",
      "saved": [
        3,
        0
      ],
      "id": 2
    }
  ],
  "techniques": [
    {
      "id": 0,
      "title": "Knee Bar",
      "slug": "knee-bar",
      "image": "knee-bar.png",
      "difficulty": 3,
      "type": [
        "Stability"
      ],
      "description": "A knee bar is a maneuver in which a climber cams their knee against a blocky, cracky, or roofy feature. This often allows the climber to hang freely without the use of one or both of their hands. This then allows them to rest in the middle of a route and regain some expended strength. Beyond recovery, a knee bar can also extend a climber's reach. Similar to a drop knee, a knee bar can work to rotate a climber's hips closer to the wall and thus extend their reach potential. Overall, this maneuver requires both leg and core strength as well as a keen awareness of the features of a given block.",
      "tutorial_links": [
        "https://www.youtube.com/watch?v=XlHh2V-BFMo"
      ]
    },
    {
      "id": 1,
      "title": "Gaston",
      "slug": "gaston",
      "image": "gaston.png",
      "difficulty": 2,
      "type": [
        "Handhold"
      ],
      "description": "Cool name huh? A gaston is a maneuver in which a climber will use their arms and hands to push outwards into a pair of handholds. This move is handhold agnostic in that it can be performed on almost any type of handhold—slopers, crimps, jugs, you name it. A gaston manevuer can be identified rather by the position of two holds relative to each other. If the positive edges of the holds are facing inwards (towards each other) then a gaston will most likely come in handy. This move is quite shoulder intensive and requires apt foot placement to lighten the load therein.",
      "tutorial_links": [
        "https://www.youtube.com/watch?v=GH7au8UIdSA"
      ]
    },
    {
      "id": 2,
      "title": "Crimp",
      "slug": "crimp",
      "image": "crimp.png",
      "difficulty": 2,
      "type": [
        "Handhold"
      ],
      "description": "Nope, not \"cramp\". But without the proper technique and grip strength training, attempting this maneuver can result in one (or worse). Both a noun and a verb, \"crimp\" can refer to a type of handhold as well as the act of gripping said handhold. Crimp handholds are characteristically smaller than most other types of handholds, sometimes offering only tens of millimeters of grippable surface area. The crimp maneuver allows climbers to utilize such handholds as they would a jug. There are a few ways that a climber can crimp, delineated by small adjustments in finger placement and bends in the knuckles. All crimps, however, recruit heavily upon finger and hand tendon strength.\nMost modern gyms will display what is called a \"hangboard\". It is usually mounted to a wall or overhang and features one, or several, incut pockets. These pockets are meant to simulate crimp handholds, and thus allow climbers to train their crimp technique away from the wall.",
      "tutorial_links": [
        "https://www.youtube.com/watch?v=t83EQqcDz6Y"
      ]
    },
    {
      "id": 3,
      "title": "Flag",
      "slug": "flag",
      "image": "flag.png",
      "difficulty": 0,
      "type": [
        "Stability",
        "Positioning"
      ],
      "description": "All hail the secret formula for next level climbing, the flag. This maneuver can be the greatest tool in a climber's toolbelt and is really quite simple to perform! Flags can come in a few different flavors, but they ultimately all share a common basic structure. Given that a climber has one foot planted on a foothold, they can then place/press their other foot into free space on the wall. Why not just place the other foot onto another foothold? As a climber progress up the grades, they will notice that footholds tend to become less positive and more sparse. Thus, another foothold may not be readily available. Placing or pressing their foot into open space on the wall (ie performing a flag) can allow a climber to generate a similar body tension that a foothold would give them.",
      "tutorial_links": [
        "https://www.youtube.com/watch?v=jLsii8s6acM",
        "https://www.youtube.com/watch?v=kZiB_T_WspE"
      ]
    },
    {
      "id": 4,
      "title": "Drop Knee",
      "slug": "drop-knee",
      "image": "drop-knee.png",
      "difficulty": 1,
      "type": [
        "Stability",
        "Positioning",
        "Footwork"
      ],
      "description": "Twist those hips, baby! The drop knee is one of those maneuvers that can send your knee to the joint cemetery if you aren't careful. However, it's also another one of those tools that has to be in a climber's tool belt if they want to progress in their climbing. The move itself is aptly named as it is characterized by a climber twisting their hips perpendicular to the wall face and dropping their knee. The resulting silhouette should look almost like a lunge (of varying depths). As previously mentioned, this maneuver works to rotate one side of a climber's hips closer to the wall which, in turn, gives the arm on that same side a necessary boost in reach distance. The drop knee requires both hip and knee flexibility in order to safely and successfully execute.",
      "tutorial_links": [
        "https://www.youtube.com/watch?v=U0v9xxqEjfY"
      ]
    }
  ],
  "comments": [
    {
      "techniqueId": 0,
      "body": "KNEEEE BAAAARRRR",
      "userId": 1,
      "username": "climberjoe",
      "id": 1
    },
    {
      "techniqueId": 2,
      "body": "Been training these with a home hang-board set! Highly recommend!",
      "userId": 1,
      "username": "climberjoe",
      "id": 2
    }
  ]
}