{
  "users": [
    {
      "username": "climberjoe",
      "password": "test",
      "id": 1,
      "saved": [
        1,
        0,
        3
      ]
    },
    {
      "username": "admin",
      "password": "test",
      "saved": [
        3,
        0
      ],
      "id": 2
    }
  ],
  "techniques": [
    {
      "id": 0,
      "title": "Knee Bar",
      "slug": "knee-bar",
      "image": "knee-bar.png",
      "difficulty": 3,
      "type": [
        "Stability"
      ],
      "description": "A knee bar is a maneuver in which a climber cams their knee against a blocky, cracky, or roofy feature. This often allows the climber to hang freely without the use of one or both of their hands. This then allows them to rest in the middle of a route and regain some expended strength. Beyond recovery, a knee bar can also extend a climber's reach. Similar to a drop knee, a knee bar can work to rotate a climber's hips closer to the wall and thus extend their reach potential. Overall, this maneuver requires both leg and core strength as well as a keen awareness of the features of a given block.",
      "tutorial_links": [
        "https://www.youtube.com/watch?v=XlHh2V-BFMo"
      ]
    },
    {
      "id": 1,
      "title": "Gaston",
      "slug": "gaston",
      "image": "gaston.png",
      "difficulty": 2,
      "type": [
        "Handhold"
      ],
      "description": "Cool name huh? A gaston is a maneuver in which a climber will use their arms and hands to push outwards into a pair of handholds. This move is handhold agnostic in that it can be performed on almost any type of handhold—slopers, crimps, jugs, you name it. A gaston manevuer can be identified rather by the position of two holds relative to each other. If the positive edges of the holds are facing inwards (towards each other) then a gaston will most likely come in handy. This move is quite shoulder intensive and requires apt foot placement to lighten the load therein.",
      "tutorial_links": []
    },
    {
      "id": 2,
      "title": "Crimp",
      "slug": "crimp",
      "image": "crimp.png",
      "difficulty": 2,
      "type": [
        "Handhold"
      ],
      "description": "Crimp description.",
      "tutorial_links": []
    },
    {
      "id": 3,
      "title": "Flag",
      "slug": "flag",
      "image": "flag.png",
      "difficulty": 0,
      "type": [
        "Stability",
        "Positioning"
      ],
      "description": "All hail the secret formula for next level climbing, the flag. This maneuver can be the greatest tool in a climber's toolbelt and is really quite simple to perform! Flags can come in a few different flavors, but they ultimately all share a common basic structure. Given that a climber has one foot planted on a foothold, they can then place/press their other foot into free space on the wall. Why not just place the other foot onto another foothold? As a climber progress up the grades, they will notice that footholds tend to become less positive and more sparse. Thus, another foothold may not be readily available. Placing or pressing their foot into open space on the wall (ie performing a flag) can allow a climber to generate a similar body tension that a foothold would give them.",
      "tutorial_links": [
        "https://www.youtube.com/watch?v=jLsii8s6acM",
        "https://www.youtube.com/watch?v=kZiB_T_WspE"
      ]
    },
    {
      "id": 4,
      "title": "Drop Knee",
      "slug": "drop-knee",
      "image": "drop-knee.png",
      "difficulty": 1,
      "type": [
        "Stability",
        "Positioning",
        "Footwork"
      ],
      "description": "Drop knee description.",
      "tutorial_links": []
    }
  ],
  "comments": [
    {
      "techniqueId": 3,
      "body": "The best move to know imo",
      "userId": 2,
      "id": 1
    }
  ]
}